-- phpMyAdmin SQL Dump
-- version 4.0.10.6
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Окт 17 2023 г., 21:14
-- Версия сервера: 5.5.41-log
-- Версия PHP: 5.3.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `test`
--

-- --------------------------------------------------------

--
-- Структура таблицы `clients`
--

CREATE TABLE IF NOT EXISTS `clients` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=16 ;

--
-- Дамп данных таблицы `clients`
--

INSERT INTO `clients` (`id`, `name`) VALUES
(1, 'Клиент 1'),
(2, 'Автомаляр'),
(3, 'ИП Иванов А.А.'),
(4, 'Тест'),
(5, 'Тестовый клиент'),
(6, 'Клиент для теста'),
(7, 'Тестовый'),
(8, 'Новый'),
(9, 'Тест_2'),
(10, 'Клиент 2'),
(11, 'Клиент 3'),
(12, 'Клиент 4'),
(13, 'Клиент 5'),
(14, 'Клиент 6'),
(15, 'Клиент 7');

-- --------------------------------------------------------

--
-- Структура таблицы `merchandise`
--

CREATE TABLE IF NOT EXISTS `merchandise` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(45) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=21 ;

--
-- Дамп данных таблицы `merchandise`
--

INSERT INTO `merchandise` (`id`, `name`) VALUES
(1, 'мыло туалетное'),
(2, 'шампунь'),
(3, 'гель для душа жен'),
(4, 'мыло хозяйственное'),
(5, 'зубная паста kids'),
(6, 'зубная паста'),
(7, 'зубная щетка для детей'),
(8, 'зубная щетка'),
(9, 'порошок детский'),
(10, 'порошок Persil'),
(11, 'гель для бритья'),
(12, 'пена для бритья'),
(13, 'гель для душа men'),
(14, 'крем для рук'),
(15, 'детский крем'),
(16, 'шампунь Bubchen'),
(17, 'лосьон после бритя'),
(18, 'мицелярная вода'),
(19, 'мусс для умывания'),
(20, 'детское мыло');

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE IF NOT EXISTS `orders` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `item_id` int(10) unsigned NOT NULL DEFAULT '0',
  `customer_id` int(10) unsigned NOT NULL DEFAULT '0',
  `comment` varchar(250) NOT NULL DEFAULT '',
  `status` varchar(15) NOT NULL DEFAULT '',
  `order_date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`),
  KEY `item_id` (`item_id`),
  KEY `customer_id` (`customer_id`),
  KEY `status` (`status`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=50 ;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `item_id`, `customer_id`, `comment`, `status`, `order_date`) VALUES
(1, 1, 1, 'позвонить за час\r\n', 'complete', '2023-10-16 22:24:48'),
(2, 2, 1, 'текстовый комментарий\r\n', 'complete', '2023-10-16 22:24:48'),
(3, 3, 2, 'новый "комментарий"\r\n', 'new', '2023-10-16 22:24:48'),
(4, 1, 1, 'позвонить за час\r\n', 'new', '2023-10-16 22:26:21'),
(5, 2, 1, 'текстовый комментарий\r\n', 'new', '2023-10-16 22:26:21'),
(6, 3, 2, 'новый "комментарий"\r\n', 'new', '2023-10-16 22:26:21'),
(7, 1, 1, 'позвонить за час\r\n', 'new', '2023-10-16 22:27:18'),
(8, 2, 1, 'текстовый комментарий\r\n', 'new', '2023-10-16 22:27:18'),
(9, 3, 2, 'новый "комментарий"\r\n', 'complete', '2023-10-16 22:27:18'),
(10, 1, 3, 'комментарий к заказу\r\n', 'new', '2023-10-16 22:27:18'),
(11, 4, 1, 'поле «комментарий» к заказу\r\n', 'complete', '2023-10-16 22:27:18'),
(12, 5, 4, 'комментарий/заказ\r\n', 'complete', '2023-10-16 22:27:18'),
(13, 2, 5, 'доставкка\r\n', 'new', '2023-10-06 22:27:18'),
(14, 7, 6, 'обязательно позвонить!\r\n', 'complete', '2023-10-16 22:27:18'),
(15, 7, 7, 'заказ №1\r\n', 'new', '2023-10-16 22:27:18'),
(16, 8, 8, 'вышлите электронный чек на почту test_1@ya.ru\r\n', 'new', '2023-10-06 22:27:18'),
(17, 1, 1, 'позвонить за час\r\n', 'new', '2023-10-16 22:28:33'),
(18, 2, 1, 'текстовый комментарий\r\n', 'complete', '2023-10-16 22:28:33'),
(19, 3, 2, 'новый "комментарий"\r\n', 'new', '2023-10-16 22:28:33'),
(20, 1, 1, 'позвонить за час\r\n', 'new', '2023-10-16 22:28:57'),
(21, 2, 1, 'текстовый комментарий\r\n', 'complete', '2023-10-16 22:28:57'),
(22, 3, 2, 'новый "комментарий"\r\n', 'complete', '2023-10-16 22:28:57'),
(23, 1, 3, 'комментарий к заказу\r\n', 'complete', '2023-10-16 22:28:57'),
(24, 4, 1, 'поле «комментарий» к заказу\r\n', 'new', '2023-10-16 22:28:57'),
(25, 5, 4, 'комментарий/заказ\r\n', 'complete', '2023-10-16 22:28:57'),
(26, 2, 5, 'доставкка\r\n', 'new', '2023-10-06 22:27:18'),
(27, 7, 6, 'обязательно позвонить!\r\n', 'complete', '2023-10-16 22:28:57'),
(28, 7, 7, 'заказ №1\r\n', 'new', '2023-10-16 22:28:57'),
(29, 8, 8, 'вышлите электронный чек на почту test_1@ya.ru\r\n', 'new', '2023-10-06 22:27:18'),
(30, 1, 1, 'позвонить за час', 'new', '2023-10-17 20:27:47'),
(31, 2, 1, 'текстовый комментарий', 'new', '2023-10-17 20:27:47'),
(32, 3, 2, 'новый "комментарий"', 'new', '2023-10-17 20:27:47'),
(33, 1, 3, '''комментарий к заказу''', 'new', '2023-10-17 20:27:47'),
(34, 4, 1, 'поле «комментарий» к заказу', 'new', '2023-10-17 20:27:47'),
(35, 5, 4, 'комментарий/заказ', 'new', '2023-10-17 20:27:47'),
(36, 2, 5, 'доставкка', 'new', '2023-10-06 22:27:18'),
(37, 7, 6, 'обязательно позвонить!', 'new', '2023-10-17 20:27:47'),
(38, 7, 7, 'заказ №1', 'new', '2023-10-17 20:27:47'),
(39, 8, 8, 'вышлите электронный чек на почту test_1@ya.ru', 'new', '2023-10-06 22:27:18'),
(40, 1, 1, 'позвонить за час', 'new', '2023-10-17 20:28:17'),
(41, 2, 1, 'текстовый комментарий', 'new', '2023-10-17 20:28:17'),
(42, 3, 2, 'новый "комментарий"', 'new', '2023-10-17 20:28:17'),
(43, 1, 3, '''комментарий к заказу''', 'new', '2023-10-17 20:28:17'),
(44, 4, 1, 'поле «комментарий» к заказу', 'new', '2023-10-17 20:28:17'),
(45, 5, 4, 'комментарий/заказ', 'new', '2023-10-17 20:28:17'),
(46, 2, 5, 'доставкка', 'new', '2023-10-06 22:27:18'),
(47, 7, 6, 'обязательно позвонить!', 'new', '2023-10-17 20:28:17'),
(48, 7, 7, 'заказ №1', 'new', '2023-10-17 20:28:17'),
(49, 8, 8, 'вышлите электронный чек на почту test_1@ya.ru', 'new', '2023-10-06 22:27:18');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
